[
{
    "id": "e9da39bc-932e-487a-b0c7-ada8cb1de6dd",
    "job_title": "Account Manager, Education Success",
    "job_description": "Position Overview Role and Responsibilities Reporting to a Director of Education Success, in this role, you will: ● Lead and provide regular and consistent communication between the Education Success team, and our education partners to maintain lasting meaningful relationships. ● Conduct presentations and product demonstrations to education professionals. ● Provide technical support of Emsi Burning Glass solutions via phone, email, and chat. ● Negotiate, invoice, and document renewals and new opportunities with partners. ● Work to establish partner-specific goals for every account you eventually manage. ● Maintain a high level of activity, manage multiple competing priorities, and work effectively in a collaborative manner. ● Serve as a liaison between Sales and Product teams to advance partner growth and success. ● Curate and edit partner success stories. ● Foster and maintain a growth mindset and a willingness to learn, adapt, listen, and lead. ● Perform miscellaneous tasks as required. ● Remain flexible to travel when necessary. The right candidate will have: ● Strong willingness to discover through interrogation and gain new insights about the vocation of education. ● Excellent social, communication (verbal and written), interpersonal, and presentation skills. ● Proficiency in Customer Relationships Management software (Salesforce), and Google or Office suite solutions. ● Demonstrated problem solving and analytical capabilities. Preferred Qualifications ● Bachelor’s degree from a regionally accredited institution of higher education. ● Familiarity with sales, selling techniques, relationship-management solutions and the education sector are strongly preferred. About Emsi Burning Glass Emsi Burning Glass is a global leader in labor market insights with headquarters in Moscow (ID) and Boston (MA) and offices in the United Kingdom, Europe, and India. We work with partners across six continents to help drive economic prosperity by solving a variety of problems in three key sectors: education, community, and corporate. The Education Success team works with more than 1,000 colleges and universities and 200 education partners to deliver career insights for learner success. Since merging in 2021, Emsi Burning Glass is rapidly expanding and actively seeking early career talent that has a passion for education, collaboration, and is eager to grow with other colleagues as part of a unique cohort hiring process. Review of applicants is rolling, so apply today! To learn more, please visitwww.economicmodeling.com/company/.",
    "location": "Remote Available",
    "date_posted": 1647977929217,
    "department": "Education",
    "team": "Client Services",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/e9da39bc-932e-487a-b0c7-ada8cb1de6dd"
},
{
    "id": "d2f21e23-9c6f-4526-afec-ca6e3c36bd36",
    "job_title": "API Developer",
    "job_description": "Emsi Burning Glass is a trusted advisor on labor market information for customers across a wide array of markets. Much of our data is available via APIs which power our software applications, and more recently are available to external customers. You can view our current API offering here: https://www.economicmodeling.com/apis/. If you are interested in joining a team focused on building out APIs and related infrastructure, we’d love to hear from you. In this role you would be responsible both for expanding our microservice architecture to include new APIs and maintaining our existing fleet.",
    "location": "Moscow, ID",
    "date_posted": 1643130949153,
    "department": "Corporate",
    "team": "Engineering",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/d2f21e23-9c6f-4526-afec-ca6e3c36bd36"
},
{
    "id": "c66d01ed-148d-43e8-8e42-d0009d3ced2a",
    "job_title": "API Solutions Architect",
    "job_description": "The API Solutions Architect serves as the go-to technical resource across the Emsi Burning Glass team for programmatic data solutions. With a primary focus on running demos during technical API and consulting sales calls, this position assists the Emsi Burning Glass sales teams in winning new business. The API Solutions Architect is expected to bring a strong knowledge of Emsi Burning Glass data and data delivery options (software to API) to client conversations. In addition, the API Solutions Architect will become an internal resource for the sales and product teams as they seek creative ways to answer customer questions regarding Emsi Burning Glass data and their business problems. Requirements: · Expertise in the use of APIs and the ability to explain them to potential customers · Excellent verbal communication skills · A customer service attitude; seeking to help teammates and clients solve issues · Knowledge of Python a requirement · Ability to build custom engineered data files directly from Emsi Burning Glass APIs and Snowflake environments as Proofs of Concept or consulting data files · Ability to troubleshoot and quality check engineered data files and Proofs of Concept before client delivery Preferred: · Expertise in Emsi Burning Glass global datasets · Expertise in the use of Emsi Burning Glass APIs and the ability to explain and demonstrate these to customers · Expertise in Emsi Burning Glass Software Platforms (US and global) and the ability to conduct compelling demonstrations of the software · Familiarity with the basic business challenges facing Enterprise people analytics teams, human resources and talent acquisition groups and staffing firms · SQL programming experience and the ability to demonstrate Snowflake environments",
    "location": "Moscow, ID",
    "date_posted": 1648677652591,
    "department": "Talent",
    "team": "Sales",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/c66d01ed-148d-43e8-8e42-d0009d3ced2a"
},
{
    "id": "e3c188d5-1310-4bba-b333-e0b4fe7cc7a1",
    "job_title": "Consulting Analyst",
    "job_description": "The Research Analyst at EMSI Burning Glass works with the Applied Research team to produce innovative research, consulting reports, datasets, data models, and visualizations that answer our clients’ most pressing problems about the future of work. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing to market actionable insights. In carrying out the objectives of this position, a successful candidate will be committed to a service-first mindset and strive to empower our clients, our employees, and our communities.",
    "location": "Boston, Massachusetts",
    "date_posted": 1630351675567,
    "department": "Talent",
    "team": "Professional Services",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/e3c188d5-1310-4bba-b333-e0b4fe7cc7a1"
},
{
    "id": "fdcb4a31-15f7-415f-af21-0493ee3294be",
    "job_title": "Content Marketing Specialist",
    "job_description": "Emsi Burning Glass is searching for an experienced full time Content Marketing Specialist to join our Talent team. This role will help to support the marketing of Emsi Burning Glass’ products and services via content creation to the Enterprise/Talent market. The primary responsibility of this position will be to create written content in the form of SEO optimized blog posts, as well as case studies, white papers, emails, etc that articulates the value proposition(s) of our tools in a clear and digestible manner. The ideal candidate will be able to write content that resonates with the target audience and is representative of trending topics for our market. Other duties may include assisting with email marketing, tracking and measuring of campaigns, and peer review",
    "location": "Remote Available",
    "date_posted": 1649951783006,
    "department": "Talent",
    "team": "Marketing",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/fdcb4a31-15f7-415f-af21-0493ee3294be"
},
{
    "id": "54a74610-4e90-4147-a58d-b40ee440c2f6",
    "job_title": "Custodian",
    "job_description": "STOP!! You've found the Custodial position you've been looking for! We are rapidly growing and fiercely dedicated to serving our clients while having fun and celebrating our successes. Emsi Burning Glass is seeking a flexible, service oriented, Custodian dedicated to delivering detailed service. You'll oversee the routine upkeep of the facilities to maintain a clean and well- functioning environment. The successful candidate will be committed to our values to sustain our company by working with gratitude, partner with customers, operate as a team!",
    "location": "Moscow, ID",
    "date_posted": 1650056001719,
    "department": "Corporate",
    "team": "Operations",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/54a74610-4e90-4147-a58d-b40ee440c2f6"
},
{
    "id": "91cad499-0a72-43eb-b32d-76286462467b",
    "job_title": "Data Engineer",
    "job_description": "We are looking for a highly motivated data engineer, who will combine software engineering skills with a strong understanding of data driven problem-solving. This job is all about coming to grips with the messy world of user-submitted data at scale (hundreds of millions of documents) and finding optimal ways to process and enrich that data. We process job postings, resumes, and professional profiles to better answer questions about what skills are available in the workforce, what colleges should be training students for, and where the opportunities lie for job-seekers. We're looking for people who have the technical skills and an interest in solving problems like: what are the best ways to process 150 million job postings and load them into Elasticsearch or how best to deduplicate 500 million professional profiles from multiple providers? This is not a machine learning position.",
    "location": "Moscow, ID",
    "date_posted": 1649274423217,
    "department": "Corporate",
    "team": "Data and Analytics",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/91cad499-0a72-43eb-b32d-76286462467b"
},
{
    "id": "1411c674-9a27-427e-be67-1aa430e7fa5a",
    "job_title": "Data Engineer, Web Scraping",
    "job_description": "Emsi Burning Glass is looking for a talented Data Engineer to work on the Web Scraping team. Their primary responsibility is to design, implement, and maintain data pipelines that transform data, adding value to it in the process. In carrying out the objective of this position, a successful candidate will be committed to our values by working with gratitude, operating as a team, and partnering with our customers.",
    "location": "Remote (Work From Home) US",
    "date_posted": 1641840808313,
    "department": "Corporate",
    "team": "Data and Analytics",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/1411c674-9a27-427e-be67-1aa430e7fa5a"
},
{
    "id": "932d5767-e635-49c4-bd66-faab540bc3a5",
    "job_title": "Director of Data Analytics",
    "job_description": "The Director of Data Analytics leads data science and analytics teams and is a partner in our transformation into a data driven organization. The Director of Data Analytics pushes the company to use data in ways that didn’t seem possible. This role focuses on turning company data assets into insights that solve our customers’ most complex problems. The Director of Data Analytics is responsible for all aspects of data analytics, data science, and data pipeline engineering: designing, developing, and testing data models, and maintaining data pipelines that feed products with insights our customers crave. This individual acts as a partner with technology and software teams to build and deliver internal products and services at scale that support the business.",
    "location": "Boston, Massachusetts",
    "date_posted": 1646241862735,
    "department": "Corporate",
    "team": "Data and Analytics",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/932d5767-e635-49c4-bd66-faab540bc3a5"
},
{
    "id": "f725048a-45bb-4381-8131-5b0407e4accf",
    "job_title": "Economic Analyst",
    "job_description": "Emsi Burning Glass is a leader in global labor market analytics. Our Global Business Unit works with universities, government agencies and other organizations to bring our world class labor market data to their challenges in Britain, Europe and the Asia-Pacific regions. As Economic Analyst, you will be part of the Global Consulting team, which uses data to produce innovative research, consulting reports, datasets, models and visualizations to answer our clients’ most pressing research questions. You will be responsible for designing and delivering insights for our customers and contributing to innovations in our growing range of labor market analytics. You will be passionate about finding answers to questions about the changing economy, the future of education and the future of work, and have advanced quantitative skills. Working with customers and colleagues you will excel at understanding problems, designing solutions and producing compelling presentations and reports. The role reports to the Head of Global Research and it is based from our UK office in Basingstoke, although many of our team are home-based.",
    "location": "Remote (Work From Home) UK",
    "date_posted": 1647631286954,
    "department": "Global",
    "team": "Professional Services",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/f725048a-45bb-4381-8131-5b0407e4accf"
},
{
    "id": "d97bf376-f693-4e15-9b7b-e27bf5da4eb1",
    "job_title": "Enterprise Account Executive",
    "job_description": "Emsi Burning Glass is hiring results-driven Enterprise Account Executives who will help develop long-term client relationships within defined multi-state territories. Enterprise Account Executives identify, mature, and close new business through active prospecting and also through our partner/channel environment. Our territories are massive, and the opportunity for growth and large-scale business development is upon us. We value hunger, intelligence, and a professional who conducts business with impeccable integrity and client-centricity. We have a growth track with immense potential in the human capital space; the opportunity to make a huge impact on the labor market, organizations and people is primed for the right business developers that want to contribute to the growth and enjoy being a part of one of the best organizations in the space.",
    "location": "Moscow, ID",
    "date_posted": 1628528249793,
    "department": "Talent",
    "team": "Sales",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/d97bf376-f693-4e15-9b7b-e27bf5da4eb1"
},
{
    "id": "d5ff0797-c6ea-4daa-88ec-ae26958fc4bc",
    "job_title": "Executive Assistant",
    "job_description": "Stop Looking! You've just found the Executive Assistant role that you've been looking for! We are rapidly growing and fiercely dedicated to serving our clients while having fun and celebrating our successes. As the Executive Assistant you will support the Chief Executive Officer (CEO), Chief Financial Officer (CFO), and Chief People Officer (CPO) with dedicated executive administration and support with communication needs, scheduling travel plans, event coordination, and streamlining administrative processes. This role will include frequent communication and interaction with senior-level personnel, and external collaborators to assist with organizational objectives.",
    "location": "Boston, Massachusetts",
    "date_posted": 1648663896599,
    "department": "Corporate",
    "team": "Human Resources",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/d5ff0797-c6ea-4daa-88ec-ae26958fc4bc"
},
{
    "id": "b0e9c4d7-bc22-4b9d-888e-c0df2f2050da",
    "job_title": "Finance Administrative Assistant",
    "job_description": "Overview The Finance Administrative Assistant reports directly to the Financial Controller and is highly involved in managing day to day tasks for the entire Finance team. Emsi is looking for a highly organized and motivated individual with strong interpersonal and written communication skills and a strong connection with our company’s core values: Work with Gratitude, Partner with Customers, Operate as a Team and Sustain our Company",
    "location": "Moscow, ID",
    "date_posted": 1571856161018,
    "department": "Corporate",
    "team": "Finance",
    "commitment": "Full Time/Part Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/b0e9c4d7-bc22-4b9d-888e-c0df2f2050da"
},
{
    "id": "e6f7ef80-84b6-4bc9-ac7e-e400a30fbce6",
    "job_title": "Financial Analyst",
    "job_description": "The Financial Analyst is part of the Emsi Burning Glass finance team and plays a crucial role in our execution of growth initiatives and constant innovation around optimizing and evaluating existing revenue and expenditure. Success in the role will require a mastery of our culture, history and operating principles to help ensure robust and thorough analysis and prevent flawed analytical results even if “technically correct.” Forms of data involved in this role are not limited to financial but will also include a wide array of operational and HR data with qualitative information and insights. The operating principle for all analysis will be production of meaningful and true analysis, never reducing to the production of numbers to support decisions stakeholders have already made. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder.",
    "location": "Moscow, ID",
    "date_posted": 1628270281318,
    "department": "Corporate",
    "team": "Finance",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/e6f7ef80-84b6-4bc9-ac7e-e400a30fbce6"
},
{
    "id": "c738640f-c582-42f2-8cfc-27657549236c",
    "job_title": "Full Stack Web Developer",
    "job_description": "Emsi is a trusted advisor on labor market information for customers across a wide array of markets. We build SaaS products that combine many different kinds of workforce data to accurately inform our clients’ decisions about college course offerings, hiring, site selection, economic development, and much more. We need an experienced developer to join us in producing premier software tools for understanding labor market data. If you’re ready to join a high-functioning team of full stack devs working closely with product managers, data engineers, and designers to create interfaces and visualizations that make nuanced data intelligible, we’d love to hear from you. Applicants to this posting will be considered for positions on the Analyst, CareerCoach, and SkillsMatch development teams.",
    "location": "Moscow, ID",
    "date_posted": 1621476684111,
    "department": "Corporate",
    "team": "Engineering",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/c738640f-c582-42f2-8cfc-27657549236c"
},
{
    "id": "ad5f4959-9276-4fba-8ddf-390446c6b95c",
    "job_title": "Join Our Talent Network!",
    "job_description": "Didn't find a job posting, but want to keep in touch? Submit your resume here, and we will reach out with any job openings that we think could be a good fit. If you have any questions about Emsi, feel free to reach out to our Talent Team at hire@emsibg.com",
    "location": "Moscow, ID",
    "date_posted": 1533930402028,
    "department": null,
    "team": "Talent Network",
    "commitment": null,
    "job_posting_url": "https://jobs.lever.co/economicmodeling/ad5f4959-9276-4fba-8ddf-390446c6b95c"
},
{
    "id": "5731ab43-1a8e-4ea9-8ea2-a1791ba50a50",
    "job_title": "Jr. Product Manager",
    "job_description": "Emsi Burning Glass, the leader in labor market analytics, is seeking a product owner who is passionate about helping communities (and community-minded organizations) solve complex workforce and economic development problems through intuitive, well-designed software that delights our clients. As Jr. Product Manager, you’ll be responsible for maximizing the value of our current products to our community clients and serving as the point person for future product development. Your work will include facilitating a cross-functional team to design, develop, and implement new product initiatives; increasing the value and profitability of existing products; and keeping an accurate pulse on the client database being served by said products. This work is done under the supervision of the Director of Product.",
    "location": "Remote (Work From Home) US",
    "date_posted": 1646076395589,
    "department": "Community Insights",
    "team": "Product",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/5731ab43-1a8e-4ea9-8ea2-a1791ba50a50"
},
{
    "id": "a6a99642-719d-4242-8522-bf2cd7573342",
    "job_title": "Junior Product Manager",
    "job_description": "Emsi Burning Glass, the leader in labor market analytics, is seeking a product owner who loves the idea of building products that help companies solve complex global workforce problems through intuitive, well-designed software that delights our clients. As Jr. Product Manager, you’ll be responsible for maximizing the value of our current products to our multi-national clients and serving as the point person for future product development. Your work will include facilitating a cross-functional team to design, develop, and implement new product initiatives; increasing the value and profitability of existing products; and keeping an accurate pulse on the clients being served by said products. This work is done under the supervision of the SVP of Global Product.",
    "location": "Moscow, ID",
    "date_posted": 1650651418156,
    "department": "Talent",
    "team": "Product",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/a6a99642-719d-4242-8522-bf2cd7573342"
},
{
    "id": "f75b4657-bdfb-47b9-8520-7d9bde8d93b8",
    "job_title": "Machine Learning Engineer",
    "job_description": "At Emsi Burning Glass, Machine Learning Engineers improve the efficiency of our data science capabilities by implementing tooling and pipelines that automate the training, testing, and deployment of data science models. ML Engineers work to leverage and scale the business by applying software engineering techniques and principles to data science work. Machine Learning Engineers work with the team to build end-to-end data science and machine learning systems and deploy the models to our APIs. Machine Learning Engineers collaborate with Software Engineers, Systems Engineers, and Hardware Engineering teams across the company.",
    "location": "Remote (Work From Home) US",
    "date_posted": 1637604066553,
    "department": "Corporate",
    "team": "Data and Analytics",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/f75b4657-bdfb-47b9-8520-7d9bde8d93b8"
},
{
    "id": "28075f3f-aa30-4b75-b48f-aad55154c071",
    "job_title": "Marketing Director",
    "job_description": "The marketing director will oversee the day-to-day operations of marketing activities for the Community Division at Emsi Burning Glass set forth by strategies collaborated on with the SVP of Business Development. The marketing director will focus on leading the Community Division marketing team through execution of the customer journey and building a steady flow of quality leads. This will include creating brand and product awareness in the economic and workforce development markets.",
    "location": "Remote (Work From Home) US",
    "date_posted": 1646775267274,
    "department": "Community Insights",
    "team": "Marketing",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/28075f3f-aa30-4b75-b48f-aad55154c071"
},
{
    "id": "595c9063-5719-436f-8f58-a1ac6df9b3b9",
    "job_title": "Press Secretary",
    "job_description": "HAVE A NOSE FOR NEWS? IF YOU ANSWERED YES..... you've found the Press Secretary role that you've been looking for! A FEW THINGS WE'RE LOOKING FOR IN THE RIGHT CANDIDATE: You'll have a sense for what makes good news and an understanding of what reporters need. You'll be a quick thinker and capable of quick rapid-responses. You'll able to think through longer-term strategies for growing earned media. And ..You'll be comfortable with data and able to explain complicated topics clearly and simply. We're rapidly growing and fiercely dedicated to serving our clients while having fun and celebrating our successes!!",
    "location": "Remote (Work From Home) US",
    "date_posted": 1650043961039,
    "department": "Corporate",
    "team": "Public Relations",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/595c9063-5719-436f-8f58-a1ac6df9b3b9"
},
{
    "id": "c0fd5d59-1578-4952-a98e-002742db9db5",
    "job_title": "Product Specialist",
    "job_description": "Product Specialists play a pivotal role in assisting our educational partners in demonstrating the career outcomes of their programs and helping guide students to the right programs and careers. In this role you’ll be providing technical expertise and support to customer needs, internal processes, and product teams. In carrying out the objective of this position, a successful candidate will be committed to our values by working with gratitude within our team to serve our clients and sustain our company. This is a full-time, entry-level position reporting to the Product Manager of Career Coach.",
    "location": "Remote Available",
    "date_posted": 1651254721096,
    "department": "Education",
    "team": "Product",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/c0fd5d59-1578-4952-a98e-002742db9db5"
},
{
    "id": "7fb034cf-bbfc-437c-8279-3a336a77fafc",
    "job_title": "Research Analyst",
    "job_description": "The Research Analyst at Emsi Burning Glass works with the Applied Research team to produce innovative research, consulting reports, datasets, data models, and visualizations that answer our clients’ most pressing problems about the future of work. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing to market actionable insights.",
    "location": "Boston, Massachusetts",
    "date_posted": 1630016219922,
    "department": "Talent",
    "team": "Professional Services",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/7fb034cf-bbfc-437c-8279-3a336a77fafc"
},
{
    "id": "3737fac0-90e8-4756-96ba-67893d393b57",
    "job_title": "Research Analyst Intern",
    "job_description": "The Research Analyst Intern at Emsi Burning Glass works with the Applied Research team to produce innovative research, consulting reports, datasets, data models, and visualizations that answer our clients’ most pressing problems about the future of work. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing to market actionable insights.",
    "location": "Boston, Massachusetts",
    "date_posted": 1639417025102,
    "department": "Talent",
    "team": "Professional Services",
    "commitment": "Internship",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/3737fac0-90e8-4756-96ba-67893d393b57"
},
{
    "id": "58606b13-40fa-4dbe-942a-94c0bf722cf1",
    "job_title": "Senior Consultant",
    "job_description": "The Senior Consultant at Emsi Burning Glass works with the Applied Research team to produce innovative research, consulting reports, datasets, data models, and visualizations that answer our clients’ most pressing problems about the future of work. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing to market actionable insights. In carrying out the objectives of this position, a successful candidate will be committed to a service-first mindset and strive to empower our clients, our employees, and our communities.",
    "location": "Boston, Massachusetts",
    "date_posted": 1630351608795,
    "department": "Talent",
    "team": "Professional Services",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/58606b13-40fa-4dbe-942a-94c0bf722cf1"
},
{
    "id": "6c85559c-8037-43ab-9694-069d995393f1",
    "job_title": "Senior Data Scientist",
    "job_description": "The Senior Data Scientist at Emsi Burning Glass works with the Product and Data teams to produce innovative models, datasets, and visualizations that address our clients’ most pressing problems about the future of work. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing actionable insights to our product suite.",
    "location": "Remote (Work From Home) US",
    "date_posted": 1633379560456,
    "department": "Corporate",
    "team": "Data and Analytics",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/6c85559c-8037-43ab-9694-069d995393f1"
},
{
    "id": "31b879cc-d97b-4407-b745-b25278490684",
    "job_title": "Senior Full Stack Web Developer",
    "job_description": "Position Overview Emsi Burning Glass is a trusted advisor on labor market information for customers across a wide array of markets. We build SaaS products that combine many different kinds of workforce data to accurately inform our clients’ decisions about college course offerings, hiring, economic development, and much more. We need a senior full stack web developer who’s passionate about building quality software with great engineers while working closely with product teams. In this role, you would be leading a small team building new, dynamic, data-heavy web applications that solve real problems for our customers. As a senior software engineer at EmsiBG, you have a position of technical leadership in a cross-functional team. You’d be expected to perform the same kind of sprint work as the other members of the team – writing, reviewing, and testing code – but at an exemplary level. You would take a leading role in feasibility and scoping discussions with our product teams, and your deep knowledge of industry trends would give you insight into how best to solve the problems they present. If you’re interested in joining a culture of grateful excellence, if you want to mentor junior engineers while growing your own engineering skill, we’d love to meet you.",
    "location": "Remote (Work From Home) US",
    "date_posted": 1649372315788,
    "department": "Corporate",
    "team": "Engineering",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/31b879cc-d97b-4407-b745-b25278490684"
},
{
    "id": "4db56402-4130-4f30-b423-26ffb693471c",
    "job_title": "Social Media Manager",
    "job_description": "Emsi Burning Glass is searching for a talented marketing professional to join our team as a Social Media Manager. This position oversees the daily management of, and strategic plan development and implementation for, Emsi Burning Glass social media accounts (Linkedin, Twitter. Facebook, Instagram, and Youtube). The strategy will focus on driving results in all areas of the customer journey, creating awareness, generating engagement, and continuously promoting our content to key market segments.",
    "location": "Moscow, ID",
    "date_posted": 1636569152420,
    "department": "Corporate",
    "team": "Public Relations",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/4db56402-4130-4f30-b423-26ffb693471c"
},
{
    "id": "e9fa0594-6ac2-45d1-b318-dac2cd5bfd0a",
    "job_title": "Software Engineer",
    "job_description": "Emsi Burning Glass is looking for a skilled software engineer to work on the Classifiers & Extractors team. This team builds and maintains high-performance text extraction and classification libraries used to analyze job postings, resumes, and similar documents. In addition to the machine learning solutions, this team also produces the internal tooling and data pipelines to support teams of taxonomists and curators working to continuously improve Emsi’s classifications and libraries. The ideal candidate has significant experience working in high-performance systems languages, a working knowledge of linear algebra, and at least basic familiarity with machine learning techniques.",
    "location": "Moscow, ID",
    "date_posted": 1641841646174,
    "department": "Corporate",
    "team": "Data and Analytics",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/e9fa0594-6ac2-45d1-b318-dac2cd5bfd0a"
},
{
    "id": "aa8b51fa-04cf-4bd4-9318-2940748da212",
    "job_title": "Software Engineering API Intern",
    "job_description": "Only local (Moscow, ID/Pullman, WA region) candidates will be considered at this time. Emsi Burning Glass is a trusted advisor on labor market information for customers across a wide array of markets. Much of our data is available via APIs which power our software applications, and more recently are available to external customers. You can view our current API offering here: https://www.economicmodeling.com/apis/. If you are interested in joining a team focused on building out APIs and related infrastructure, we’d love to hear from you. In this role you would be responsible both for expanding our microservice architecture to include new APIs and maintaining our existing fleet.",
    "location": "Moscow, ID",
    "date_posted": 1650941553722,
    "department": "Corporate",
    "team": "Engineering",
    "commitment": "Internship",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/aa8b51fa-04cf-4bd4-9318-2940748da212"
},
{
    "id": "1454d90e-65d4-4a78-b6e2-8ced1c6a01a8",
    "job_title": "Software Product Manager",
    "job_description": "Emsi Burning Glass is a trusted advisor on labor market information for customers across a wide array of markets. Our Analyst SaaS product combines many different kinds of workforce data to accurately inform our clients’ decisions about college course offerings, hiring, site selection, economic development, and much more. As we look to make better and better use of our industry-leading data, we need a product manager to help manage the Analyst software platform. With tremendous runway in multiple markets, we are looking for a thoughtful, data-driven, customer-focused product manager to manage and sequence projects on the Analyst platform. This senior product role will also be responsible for identifying and pursuing new platform capabilities and efficiencies, as well as assessing platform usage through analytics software. If you’re ready to join a high-functioning team of product managers working closely with talented engineers, designers, and data experts, we’d love to hear from you.",
    "location": "Moscow, ID",
    "date_posted": 1635808313283,
    "department": "Corporate",
    "team": "Product",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/1454d90e-65d4-4a78-b6e2-8ced1c6a01a8"
},
{
    "id": "f2ec98d7-7508-41f2-ad8a-d249b7e1d44a",
    "job_title": "Sr. Product Designer",
    "job_description": "The Education Product & Design Team at Emsi Burning Glass is laser-focused on helping institutions provide students with the educational opportunities they need to thrive in a competitive labor market. Our current products turn labor market data into insights that drive new academic program development, help institutions attract, retain and support students, and track post-graduate outcomes. Our new products will continue to drive impact in higher education, for students, and in the labor market at large. We’re on the hunt for a talented designer to join our team. As a designer at Emsi Burning Glass, you will design and deliver elegant product experiences as part of a cross-functional team. You will continuously build on your understanding of the challenges present in higher education and the uses of labor market data in that context. You'll talk to our customers to empathize with their needs. You’ll partner with product managers and engineers to design solutions that serve customer and learner needs and deliver value for the company.",
    "location": "Remote (Work From Home) US",
    "date_posted": 1646257671667,
    "department": "Education",
    "team": "Product",
    "commitment": "Full Time",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/f2ec98d7-7508-41f2-ad8a-d249b7e1d44a"
}
]