[
{
    "job_id": "e9da39bc-932e-487a-b0c7-ada8cb1de6dd",
    "job_title": "Account Manager, Education Success",
    "job_description": "Position Overview Role and Responsibilities Reporting to a Director of Education Success, in this role, you will: ● Lead and provide regular and consistent communication between the Education Success team, and our education partners to maintain lasting meaningful relationships. ● Conduct presentations and product demonstrations to education professionals. ● Provide technical support of Emsi Burning Glass solutions via phone, email, and chat. ● Negotiate, invoice, and document renewals and new opportunities with partners. ● Work to establish partner-specific goals for every account you eventually manage. ● Maintain a high level of activity, manage multiple competing priorities, and work effectively in a collaborative manner. ● Serve as a liaison between Sales and Product teams to advance partner growth and success. ● Curate and edit partner success stories. ● Foster and maintain a growth mindset and a willingness to learn, adapt, listen, and lead. ● Perform miscellaneous tasks as required. ● Remain flexible to travel when necessary. The right candidate will have: ● Strong willingness to discover through interrogation and gain new insights about the vocation of education. ● Excellent social, communication (verbal and written), interpersonal, and presentation skills. ● Proficiency in Customer Relationships Management software (Salesforce), and Google or Office suite solutions. ● Demonstrated problem solving and analytical capabilities. Preferred Qualifications ● Bachelor’s degree from a regionally accredited institution of higher education. ● Familiarity with sales, selling techniques, relationship-management solutions and the education sector are strongly preferred. About Emsi Burning Glass Emsi Burning Glass is a global leader in labor market insights with headquarters in Moscow (ID) and Boston (MA) and offices in the United Kingdom, Europe, and India. We work with partners across six continents to help drive economic prosperity by solving a variety of problems in three key sectors: education, community, and corporate. The Education Success team works with more than 1,000 colleges and universities and 200 education partners to deliver career insights for learner success. Since merging in 2021, Emsi Burning Glass is rapidly expanding and actively seeking early career talent that has a passion for education, collaboration, and is eager to grow with other colleagues as part of a unique cohort hiring process. Review of applicants is rolling, so apply today! To learn more, please visitwww.economicmodeling.com/company/.",
    "location": "Remote Available",
    "date_posted": 1647977929217,
    "commitment": "Full Time",
    "department": "Education",
    "team": "Client Services",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/e9da39bc-932e-487a-b0c7-ada8cb1de6dd"
},
{
    "job_id": "d2f21e23-9c6f-4526-afec-ca6e3c36bd36",
    "job_title": "API Developer",
    "job_description": "Emsi Burning Glass is a trusted advisor on labor market information for customers across a wide array of markets. Much of our data is available via APIs which power our software applications, and more recently are available to external customers. You can view our current API offering here: https://www.economicmodeling.com/apis/. If you are interested in joining a team focused on building out APIs and related infrastructure, we’d love to hear from you. In this role you would be responsible both for expanding our microservice architecture to include new APIs and maintaining our existing fleet.",
    "additional_job_details": [
        {
            "content": "People who succeed in this position are…: Team oriented and ready to work closely with other developers Determined to produce clean, well-tested code Comfortable working in rapid development cycles Skilled communicators Enthusiastic about learning and pushing the envelope"
        },
        {
            "content": "Candidates must have…: Experience with Python Experience using a version control system Familiarity with ElasticSearch Familiarity with REST APIs DevOps experience"
        },
        {
            "content": "Great candidates also have…: Experience with relational databases like PostgreSQL Experience with ElasticSearch Experience working in a microservice architecture Experience building and running APIs"
        }
    ],
    "location": "Moscow, ID",
    "date_posted": 1643130949153,
    "commitment": "Full Time",
    "department": "Corporate",
    "team": "Engineering",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/d2f21e23-9c6f-4526-afec-ca6e3c36bd36"
},
{
    "job_id": "c66d01ed-148d-43e8-8e42-d0009d3ced2a",
    "job_title": "API Solutions Architect",
    "job_description": "The API Solutions Architect serves as the go-to technical resource across the Emsi Burning Glass team for programmatic data solutions. With a primary focus on running demos during technical API and consulting sales calls, this position assists the Emsi Burning Glass sales teams in winning new business. The API Solutions Architect is expected to bring a strong knowledge of Emsi Burning Glass data and data delivery options (software to API) to client conversations. In addition, the API Solutions Architect will become an internal resource for the sales and product teams as they seek creative ways to answer customer questions regarding Emsi Burning Glass data and their business problems. Requirements: · Expertise in the use of APIs and the ability to explain them to potential customers · Excellent verbal communication skills · A customer service attitude; seeking to help teammates and clients solve issues · Knowledge of Python a requirement · Ability to build custom engineered data files directly from Emsi Burning Glass APIs and Snowflake environments as Proofs of Concept or consulting data files · Ability to troubleshoot and quality check engineered data files and Proofs of Concept before client delivery Preferred: · Expertise in Emsi Burning Glass global datasets · Expertise in the use of Emsi Burning Glass APIs and the ability to explain and demonstrate these to customers · Expertise in Emsi Burning Glass Software Platforms (US and global) and the ability to conduct compelling demonstrations of the software · Familiarity with the basic business challenges facing Enterprise people analytics teams, human resources and talent acquisition groups and staffing firms · SQL programming experience and the ability to demonstrate Snowflake environments",
    "location": "Moscow, ID",
    "date_posted": 1648677652591,
    "commitment": "Full Time",
    "department": "Talent",
    "team": "Sales",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/c66d01ed-148d-43e8-8e42-d0009d3ced2a"
},
{
    "job_id": "e3c188d5-1310-4bba-b333-e0b4fe7cc7a1",
    "job_title": "Consulting Analyst",
    "job_description": "The Research Analyst at EMSI Burning Glass works with the Applied Research team to produce innovative research, consulting reports, datasets, data models, and visualizations that answer our clients’ most pressing problems about the future of work. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing to market actionable insights. In carrying out the objectives of this position, a successful candidate will be committed to a service-first mindset and strive to empower our clients, our employees, and our communities.",
    "additional_job_details": [
        {
            "content": "Core Responsibilities: Support client projects by performing quantitative analysis using EMSI Burning Glass’s world-class workforce data and other data sources to research, model, and recommend workforce solutions for global employers. Develop knowledge of issues related to human resources, workforce analytics and planning, and/or the impact of emerging technologies on the future of work. Generate custom datasets, reports, and visualizations that solve clients’ most pressing workforce challenges. Communicate key insights and recommendations to clients and consult clients on how to use data to make data-driven decisions. Develop innovative analytical models and document the methodology and findings in a manner accessible to a variety of audiences. Contribute to positive team culture by participating in team-building activities and being a supportive and empathetic colleague."
        },
        {
            "content": "Knowledge, Skills, Abilities: Strong written and verbal communication skills. Strong analytical skills. Strong quality assurance skills with attention to detail in both quantitative analyses and technical writing. Proficiency with SQL, Python, or related analytical tools and programming languages. Proficiency with Microsoft Office Suite and Google Suite with advanced skills in Excel and PowerPoint. Ability to work effectively both independently and in a team environment. Creative problem-solving skills and the ability to look at the numbers, trends, and data to derive conclusions based on findings. Ability to compose written analyses that explain complex economic or analytical concepts in simple terms."
        },
        {
            "content": "Credentials and Experience: Bachelor’s degree or above in a field with a strong quantitative and analytic focus, or at least 3-years of experience in performing statistical or economic analysis. Experience making and communicating data-driven decisions, preferably in a role related to consulting, human resources, workforce planning, economic analysis, or a similar environment."
        }
    ],
    "location": "Boston, Massachusetts",
    "date_posted": 1630351675567,
    "commitment": "Full Time",
    "department": "Talent",
    "team": "Professional Services",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/e3c188d5-1310-4bba-b333-e0b4fe7cc7a1"
},
{
    "job_id": "fdcb4a31-15f7-415f-af21-0493ee3294be",
    "job_title": "Content Marketing Specialist",
    "job_description": "Emsi Burning Glass is searching for an experienced full time Content Marketing Specialist to join our Talent team. This role will help to support the marketing of Emsi Burning Glass’ products and services via content creation to the Enterprise/Talent market. The primary responsibility of this position will be to create written content in the form of SEO optimized blog posts, as well as case studies, white papers, emails, etc that articulates the value proposition(s) of our tools in a clear and digestible manner. The ideal candidate will be able to write content that resonates with the target audience and is representative of trending topics for our market. Other duties may include assisting with email marketing, tracking and measuring of campaigns, and peer review",
    "additional_job_details": [
        {
            "content": "Requirements: Motivated self starter Strong writing/verbal communication skills Experience writing in a professional setting Knowledge of writing for search engine optimization Strong organization and collaboration skills Ability to simplify complex concepts and communicate them in written format"
        },
        {
            "content": "Preferred Skills: Experience with inbound marketing and analytics Previous experience working at a B2B and/or SaaS company Experience with copywriting"
        }
    ],
    "location": "Remote Available",
    "date_posted": 1649951783006,
    "commitment": "Full Time",
    "department": "Talent",
    "team": "Marketing",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/fdcb4a31-15f7-415f-af21-0493ee3294be"
},
{
    "job_id": "54a74610-4e90-4147-a58d-b40ee440c2f6",
    "job_title": "Custodian",
    "job_description": "STOP!! You've found the Custodial position you've been looking for! We are rapidly growing and fiercely dedicated to serving our clients while having fun and celebrating our successes. Emsi Burning Glass is seeking a flexible, service oriented, Custodian dedicated to delivering detailed service. You'll oversee the routine upkeep of the facilities to maintain a clean and well- functioning environment. The successful candidate will be committed to our values to sustain our company by working with gratitude, partner with customers, operate as a team!",
    "additional_job_details": [
        {
            "content": "Some of the Things You'll Do: Maintain a working knowledge of Emsi’s facilities and maintenance plans in order to spot custodial needs. Maintain Emsi’s facilities to be a clean and presentable environment for all. Complete routine cleaning such as trash removal, bathrooms, windows, floors and surfaces. Complete exterior cleaning tasks around the building and on the property. Maintain appropriate inventory of cleaning supplies and keep facilities well stocked. Notify Facilities Coordinator of maintenance needs throughout the facility. Perform other related duties as assigned."
        },
        {
            "content": "What You'll Need to Apply : Strong communication skills. Ability to lift up to 50 pounds. Ability to work on your feet for long periods of time. Ability to work a flexible schedule including weekend work. Knowledge of cleaning materials and methods. Knowledge of general occupational hazards and safety protocols."
        }
    ],
    "location": "Moscow, ID",
    "date_posted": 1650056001719,
    "commitment": "Full Time",
    "department": "Corporate",
    "team": "Operations",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/54a74610-4e90-4147-a58d-b40ee440c2f6"
},
{
    "job_id": "91cad499-0a72-43eb-b32d-76286462467b",
    "job_title": "Data Engineer",
    "job_description": "We are looking for a highly motivated data engineer, who will combine software engineering skills with a strong understanding of data driven problem-solving. This job is all about coming to grips with the messy world of user-submitted data at scale (hundreds of millions of documents) and finding optimal ways to process and enrich that data. We process job postings, resumes, and professional profiles to better answer questions about what skills are available in the workforce, what colleges should be training students for, and where the opportunities lie for job-seekers. We're looking for people who have the technical skills and an interest in solving problems like: what are the best ways to process 150 million job postings and load them into Elasticsearch or how best to deduplicate 500 million professional profiles from multiple providers? This is not a machine learning position.",
    "additional_job_details": [
        {
            "content": "Responsibilities: Be familiar with our data clients, both in-house and external, and determine how best to get our data into their tools. Build and maintain data processing pipelines for several major data sources for job postings and professional profiles. Create and preserve knowledge with well-written documentation. Maintain Elasticsearch clusters and the servers they run on."
        },
        {
            "content": "Specific Requirements: 2+ years experience in a professional setting. Strong software engineering, programming, and QA skills Proficiency with Linux (or other POSIX). Proficiency with a systems programming language. Experience with lean/agile development, kanban, and test-driven development practices, preferred. Gitlab, AWS ecosystem, preferred. Experience with D and/or Scala languages, preferred. Experience with batch processing (AWS Batch) and/or Apache Spark (AWS EMR), preferred."
        }
    ],
    "location": "Moscow, ID",
    "date_posted": 1649274423217,
    "commitment": "Full Time",
    "department": "Corporate",
    "team": "Data and Analytics",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/91cad499-0a72-43eb-b32d-76286462467b"
},
{
    "job_id": "1411c674-9a27-427e-be67-1aa430e7fa5a",
    "job_title": "Data Engineer, Web Scraping",
    "job_description": "Emsi Burning Glass is looking for a talented Data Engineer to work on the Web Scraping team. Their primary responsibility is to design, implement, and maintain data pipelines that transform data, adding value to it in the process. In carrying out the objective of this position, a successful candidate will be committed to our values by working with gratitude, operating as a team, and partnering with our customers.",
    "additional_job_details": [
        {
            "content": "Core Responsibilities: Create and improve processes, tools, workflows, and resilient data architecture to scrape web content. Manage data accuracy and quality. Identify and rectify any issues with breaks as well as scale scrapers as needed."
        },
        {
            "content": "Organizational Relationships: This position reports to the Senior Director of Data Innovation."
        },
        {
            "content": "Knowledge, Skills, and Abilities: Web scraping experience (Scrapy or similar technologies) Solid understanding of web technologies (HTML, JavaScript, CSS, XPath, JSON, etc) Experience with ETL and creating data pipelines Basic Linux and Git experience Python Scrapy Python library AWS/AWS Batch Familiarity with data processing tools (pandas, regex, SQL)"
        },
        {
            "content": "Traits: Attention to detail Self-starter Curious Customer Oriented Organized Problem solving"
        },
        {
            "content": "Credentials and Experience: 2+ years Python experience, preferred Professional experience with web scraping preferred Bachelor’s degree, preferred"
        }
    ],
    "location": "Remote (Work From Home) US",
    "date_posted": 1641840808313,
    "commitment": "Full Time",
    "department": "Corporate",
    "team": "Data and Analytics",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/1411c674-9a27-427e-be67-1aa430e7fa5a"
},
{
    "job_id": "932d5767-e635-49c4-bd66-faab540bc3a5",
    "job_title": "Director of Data Analytics",
    "job_description": "The Director of Data Analytics leads data science and analytics teams and is a partner in our transformation into a data driven organization. The Director of Data Analytics pushes the company to use data in ways that didn’t seem possible. This role focuses on turning company data assets into insights that solve our customers’ most complex problems. The Director of Data Analytics is responsible for all aspects of data analytics, data science, and data pipeline engineering: designing, developing, and testing data models, and maintaining data pipelines that feed products with insights our customers crave. This individual acts as a partner with technology and software teams to build and deliver internal products and services at scale that support the business.",
    "additional_job_details": [
        {
            "content": "Responsibilities: Engage business and product stakeholders to understand their roadmap, strategize and develop hypotheses, and design analytical models to drive business decisions. Participate in product design offering potential insights to better EBG products and convey the feasibility in terms of data quality and implementation challenge for requested insights. Design model algorithms encompassing data science, statistical models, manipulation of public datasets, and data-driven user workflows. Collaborate with Engineering, Marketing, and other Analytics teams to deliver impactful data and insights. Facilitate collaboration between technology teams to capture dependencies and ensure that correct technologies are built to meet the needs of EBG products. Own and lead the organizational data science and data analytics capabilities Communicate key insights and recommendations to senior leadership across the organization to influence the strategic agenda. Engage with the Research teams to understand its applicability for productization in products Hire, manage, and develop a team of analysts and data scientists, including coaching, onboarding, and training."
        },
        {
            "content": "Requirements: Bachelor's degree in Statistics, Mathematics, Economics, Engineering, or related technical field. Master’s degree preferred. 5+ years experience developing analytical and/or data science methods. 3+ years in a hands-on data analytics management role. Experience defining a clear, robust roadmap and delivering against it. Experience designing and implementing highly visible, complex, and innovative analytical solutions that drive business decision making. Demonstrated success influencing senior level stakeholders on strategic direction based on insights backed by in-depth analysis. Strong written and verbal communication. Experience in mentoring and developing a team."
        }
    ],
    "location": "Boston, Massachusetts",
    "date_posted": 1646241862735,
    "commitment": "Full Time",
    "department": "Corporate",
    "team": "Data and Analytics",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/932d5767-e635-49c4-bd66-faab540bc3a5"
},
{
    "job_id": "f725048a-45bb-4381-8131-5b0407e4accf",
    "job_title": "Economic Analyst",
    "job_description": "Emsi Burning Glass is a leader in global labor market analytics. Our Global Business Unit works with universities, government agencies and other organizations to bring our world class labor market data to their challenges in Britain, Europe and the Asia-Pacific regions. As Economic Analyst, you will be part of the Global Consulting team, which uses data to produce innovative research, consulting reports, datasets, models and visualizations to answer our clients’ most pressing research questions. You will be responsible for designing and delivering insights for our customers and contributing to innovations in our growing range of labor market analytics. You will be passionate about finding answers to questions about the changing economy, the future of education and the future of work, and have advanced quantitative skills. Working with customers and colleagues you will excel at understanding problems, designing solutions and producing compelling presentations and reports. The role reports to the Head of Global Research and it is based from our UK office in Basingstoke, although many of our team are home-based.",
    "additional_job_details": [
        {
            "content": "Core Responsibilities: Design and produce quantitative labor market analysis using EMSI Burning Glass data and other data sources Turn analysis into compelling stories, told through reports and presentations Collaborate and communicate with customers, managing projects from scoping through to delivery Design and deliver internal research projects to develop data and apply it to new problems Work closely with colleagues to manage relationships, developing sales proposals and thought-leadership content Work closely with colleagues to find ways to improve and add value to the work we do, support our clients and create methods which make the complex simple Develop knowledge of issues related to the future of work and skills for economic development agencies and education providers in the UK and beyond Contributing to a positive team culture by working collaboratively and flexibly with colleagues across the business unit."
        },
        {
            "content": "Knowledge, skills & abilities: Advanced quantitative skills Knowledge of labor market concepts and of UK official economic statistics Excellent written and verbal communication skills Ability to meet milestones while juggling multiple responsibilities and work with minimal supervision Ability to work with clients, understand their needs and communicate our work in a clear and concise manner Proficiency with a programming language for data analysis, in particular Python, would be especially desirable Working knowledge of any other language and of official economic statistics in other European countries would be an advantage."
        },
        {
            "content": "Credentials and Experience: Bachelor’s degree or above in a field with a strong quantitative and analytic focus At least 2 years of relevant experience in a consulting, think-tank or strategy and policy role."
        }
    ],
    "location": "Remote (Work From Home) UK",
    "date_posted": 1647631286954,
    "commitment": "Full Time",
    "department": "Global",
    "team": "Professional Services",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/f725048a-45bb-4381-8131-5b0407e4accf"
},
{
    "job_id": "d97bf376-f693-4e15-9b7b-e27bf5da4eb1",
    "job_title": "Enterprise Account Executive",
    "job_description": "Emsi Burning Glass is hiring results-driven Enterprise Account Executives who will help develop long-term client relationships within defined multi-state territories. Enterprise Account Executives identify, mature, and close new business through active prospecting and also through our partner/channel environment. Our territories are massive, and the opportunity for growth and large-scale business development is upon us. We value hunger, intelligence, and a professional who conducts business with impeccable integrity and client-centricity. We have a growth track with immense potential in the human capital space; the opportunity to make a huge impact on the labor market, organizations and people is primed for the right business developers that want to contribute to the growth and enjoy being a part of one of the best organizations in the space.",
    "additional_job_details": [
        {
            "content": "Job Requirements: Prospect within enterprise accounts via phone, email, social selling, and other creative outbound/inbound and channel-driven approaches. Build a pipeline with positive professional client relationships while working in collaboration with internal team members in marketing, consulting, customer-service and product development, to provide the best solutions for our clients Work with multiple client contacts to create demand across the business as you leverage the executive buying cycle Engage a consultative sales methodology with an average sales cycle of 9 months or less Help potential customers define needs clearly and deliver software, data and consulting solutions that empower these organizations to optimize talent management strategies Use research, creativity, and analysis to craft and deliver highly relevant presentations to clients via online and in-person meetings Learn and use the economic and data concepts that relate to our services and the situations of our clients Effectively mentor and guide your assigned Business Development Rep to help generate leads"
        },
        {
            "content": "Specific Qualifications: 4+ years experience with consultative and/or solution-based software sales Track record of consistent performance (top 10-20% of company) Familiarity with the human resources function and HR tech/consulting space is a huge asset Energetic, optimistic, and entrepreneurial Desire to work in a mature, sophisticated, and professional client/sales environment Excellent time-management and communication skills, verbal/written/visual Ability to positively adapt to change in a highly dynamic work environment Ability to travel as needed, as appropriate in today’s selling environment Outstanding written and verbal communication, presentation, and time management skills Technically savvy (familiarity with sales automation tools) and specifically skilled using Salesforce to manage sales cycles Process-driven, organized and self-motivated Bachelor’s degree in business, communication, HR or other related fields"
        }
    ],
    "location": "Moscow, ID",
    "date_posted": 1628528249793,
    "commitment": "Full Time",
    "department": "Talent",
    "team": "Sales",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/d97bf376-f693-4e15-9b7b-e27bf5da4eb1"
},
{
    "job_id": "d5ff0797-c6ea-4daa-88ec-ae26958fc4bc",
    "job_title": "Executive Assistant",
    "job_description": "Stop Looking! You've just found the Executive Assistant role that you've been looking for! We are rapidly growing and fiercely dedicated to serving our clients while having fun and celebrating our successes. As the Executive Assistant you will support the Chief Executive Officer (CEO), Chief Financial Officer (CFO), and Chief People Officer (CPO) with dedicated executive administration and support with communication needs, scheduling travel plans, event coordination, and streamlining administrative processes. This role will include frequent communication and interaction with senior-level personnel, and external collaborators to assist with organizational objectives.",
    "additional_job_details": [
        {
            "content": " Here are the responsibilities of the role: Provides extensive and continuous management of calendars, domestic and international travel, expenses, event registrations and detailed meeting planning and all other executive support. Acts as a representative regarding internal and external relations and correspondence and screening communications. Arranges on-and off-site meetings, events, appointments, and travel. Supplying materials as needed and organizing catering when necessary. Coordinates meetings, creates PowerPoint presentations, and organizes monthly reporting. Assists with tracking key operational metrics by organizing and compiling data, researching facts, and coordinating information retrieval. Independently performs special projects. Responds to a wide variety of requests, analyzes matters and determines approach and priority. Provides administrative support to the Executive Leadership Team (ELT) as needed. Other duties as assigned."
        },
        {
            "content": "Here’s what you’ll need to apply: Capacity and desire to partner with customers, operate as a team, sustain our company and work with gratitude. Maintain confidentiality in all aspects of team and company information. Exceptional verbal and written communication skills. Excellent interpersonal and customer service skills. Solid organizational skills and attention to detail. Ability to operate independently with minimal supervision. Available during regular business working hours and during off-hours as needed. Outstanding time management skills with a proven ability to meet deadlines. Strong analytical and problem-solving skills. Ability to function well in a high-paced environment. Proficient with Google Workspace or related software."
        },
        {
            "content": "Education and Experience: A Bachelor’s degree and three years experience in a related field. OR Any combination of education and experience that would provide the applicant with the desired skill, knowledge, and ability required to perform the job."
        }
    ],
    "location": "Boston, Massachusetts",
    "date_posted": 1648663896599,
    "commitment": "Full Time",
    "department": "Corporate",
    "team": "Human Resources",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/d5ff0797-c6ea-4daa-88ec-ae26958fc4bc"
},
{
    "job_id": "b0e9c4d7-bc22-4b9d-888e-c0df2f2050da",
    "job_title": "Finance Administrative Assistant",
    "job_description": "Overview The Finance Administrative Assistant reports directly to the Financial Controller and is highly involved in managing day to day tasks for the entire Finance team. Emsi is looking for a highly organized and motivated individual with strong interpersonal and written communication skills and a strong connection with our company’s core values: Work with Gratitude, Partner with Customers, Operate as a Team and Sustain our Company",
    "additional_job_details": [
        {
            "content": "Duties and Responsibilities: Manage corporate credit card usage by collecting and documenting all receipts from corporate card holders in a timely manner. Upon a mangers request, issue corporate credit cards for new employees. Respond to customer queries in a polite and timely manner, while knowing when to include other Finance team members. Establish a working knowledge of Emsi’s customer system of record, SalesForce, to access to customer accounts. Keep excellent records of all communication with customers. Communicate effectively with customers via phone and email regarding late payments. Follow-through with customers until resolution of late accounts is established. Assist the Controller in the day to day tasks of running the Finance department as requested. Maintain all Finance department records in an orderly fashion."
        },
        {
            "content": "Job Qualifications and Requirements: A degree isn’t mandatory for the Finance Administrator role, but evidence of administrative skills is required. A successful candidate possesses attention to detail, data entry, and multitasking skills that balances adhering to process with being attentive to the bigger picture. The Finance Administrative Assistant role interacts with employees and customers on a daily basis, so the ability to interact in a professional and cheerful manner at all times is necessary. The ideal candidate also makes systematic and consistent efforts to ensure Emsi’s late customer payments are brought in and Emsi’s records are in good order, efficiently stewarding Emsi’s resources. The successful candidate balances best processes with thoughtful consideration of the larger picture in order to embody Emsi’s core values: bless the customer, bless the employee, and bless the shareholder."
        }
    ],
    "location": "Moscow, ID",
    "date_posted": 1571856161018,
    "commitment": "Full Time/Part Time",
    "department": "Corporate",
    "team": "Finance",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/b0e9c4d7-bc22-4b9d-888e-c0df2f2050da"
},
{
    "job_id": "e6f7ef80-84b6-4bc9-ac7e-e400a30fbce6",
    "job_title": "Financial Analyst",
    "job_description": "The Financial Analyst is part of the Emsi Burning Glass finance team and plays a crucial role in our execution of growth initiatives and constant innovation around optimizing and evaluating existing revenue and expenditure. Success in the role will require a mastery of our culture, history and operating principles to help ensure robust and thorough analysis and prevent flawed analytical results even if “technically correct.” Forms of data involved in this role are not limited to financial but will also include a wide array of operational and HR data with qualitative information and insights. The operating principle for all analysis will be production of meaningful and true analysis, never reducing to the production of numbers to support decisions stakeholders have already made. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder.",
    "additional_job_details": [
        {
            "content": "Core Responsibilities: Maintain a working knowledge of Emsi’s various products and services. Produce monthly slide decks for Emsi and BUs (typically within 3 working days of month end). Schedule BU meetings to occur within 7 working days of month end. Attend BU meetings with (a) ability to comment on any apparent data anomalies or reasonable questions and (b) mechanism to record any agreed changes / developments and implement immediately so that the same request is not needed twice. Coordinate development and production of any special slide decks whether part of the monthly BU meetings or separately (e.g. BU renewals, sales, product trajectories, cost areas, etc.). Organize data and records, and capably record the results of decisions and discussions so that leadership can rely on your work while assessing success of growth investments. Produce scopes for any analytics requests, to be agreed to with your manager before performing an analytics request. This process is to be used for all requests even from those higher up the org chart than your manager (e.g. CEO, parent company, investors). Quarterly review of product catalogue in SalesForce with product and business leaders to ensure obsolete products are removed and new products are included, with any additions or removals being approved by COO and CEO. Perform required seasonal reporting to assist in launch of new markets, products or similar, which may include weekly cadence of reporting; looking to transition such projects into the typical workflow when increased cadence no longer provides significant value. Play a special role in the annual budget process and periodic forecast updates throughout the year, coordinating such efforts with colleagues on the financial accounting team. Complete special projects as assigned (e.g. tracking costs related to a grant, or potential insurance and/or legal claim.) Pursue professional development so that your current abilities and experiences do not define the upper limit on what you can contribute to Emsi. This could include advocating for formal professional development but will also include spending time learning from those you are connected with professionally, such as at Emsi’s parent company. Collaborate with IT and others in finance to assist in evaluating and implementing analytical tools and systems with foresight to articulate deficiencies that hold you back from success."
        },
        {
            "content": "Organizational Relationships: The Financial Analyst reports directly to the Controller and also works closely with COO/CFO and other stakeholders including BU Leaders, Product, Marketing, Sales and Customer Service Leaders, Sr. Financial Analyst at Parent Company and/or other designated representatives at Parent Company or other investors and Emsi board members."
        },
        {
            "content": "Knowledge, Skills, and Abilities: Strong written and verbal communication skills with the ability to communicate “up” the organizational chart avoiding any surprises. Advanced knowledge of Excel and proficiency with Microsoft Office Suite. Critical-thinking skills. Strong organizational skills. Ability to handle ambiguous project and maintain feedback through each step to completion. Ability to coordinate with broad stakeholder groups. Ability to judge and balance confident execution of projects with manager input and review, while maintaining awareness to take direct and indirect feedback around the balancing of these competing priorities. Ability to review your own work for anomalies that indicate flaws in analysis and have the energy and intuition to enquire with relevant parties regarding anything that needs validating or testing."
        },
        {
            "content": "Traits: Curious Focused Service-oriented Analytical Accountable Approachable Honest Forthright Flexible"
        },
        {
            "content": "Credentials and Experience : Bachelor’s Degree in accounting, finance, statistics, economics business administration or a related field. SaaS experience preferred."
        },
        {
            "content": "Physical Requirment/Work Environment: Those necessary for general office work. Typical office environment majority of the time."
        }
    ],
    "location": "Moscow, ID",
    "date_posted": 1628270281318,
    "commitment": "Full Time",
    "department": "Corporate",
    "team": "Finance",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/e6f7ef80-84b6-4bc9-ac7e-e400a30fbce6"
},
{
    "job_id": "c738640f-c582-42f2-8cfc-27657549236c",
    "job_title": "Full Stack Web Developer",
    "job_description": "Emsi is a trusted advisor on labor market information for customers across a wide array of markets. We build SaaS products that combine many different kinds of workforce data to accurately inform our clients’ decisions about college course offerings, hiring, site selection, economic development, and much more. We need an experienced developer to join us in producing premier software tools for understanding labor market data. If you’re ready to join a high-functioning team of full stack devs working closely with product managers, data engineers, and designers to create interfaces and visualizations that make nuanced data intelligible, we’d love to hear from you. Applicants to this posting will be considered for positions on the Analyst, CareerCoach, and SkillsMatch development teams.",
    "additional_job_details": [
        {
            "content": "People who succeed in this position are: Team oriented and ready to work closely with other developers Comfortable with working in rapid development cycles Skilled oral and written communicators Enthusiastic for learning Prepared to contribute at a strategic level to engineering excellence discussions from day one"
        },
        {
            "content": "Candidates must have: : Two years of experience with React development in a production environment Two years or more experience with server-side languages like PHP, Python, or Node One or more years of experience managing production environments in AWS Working knowledge of structured databases, e.g. MySQL, PostgreSQL"
        },
        {
            "content": "Great candidates also have: Experience with microservice architecture Experience building and consuming APIs"
        }
    ],
    "location": "Moscow, ID",
    "date_posted": 1621476684111,
    "commitment": "Full Time",
    "department": "Corporate",
    "team": "Engineering",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/c738640f-c582-42f2-8cfc-27657549236c"
},
{
    "job_id": "ad5f4959-9276-4fba-8ddf-390446c6b95c",
    "job_title": "Join Our Talent Network!",
    "job_description": "Didn't find a job posting, but want to keep in touch? Submit your resume here, and we will reach out with any job openings that we think could be a good fit. If you have any questions about Emsi, feel free to reach out to our Talent Team at hire@emsibg.com",
    "location": "Moscow, ID",
    "date_posted": 1533930402028,
    "team": "Talent Network",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/ad5f4959-9276-4fba-8ddf-390446c6b95c"
},
{
    "job_id": "5731ab43-1a8e-4ea9-8ea2-a1791ba50a50",
    "job_title": "Jr. Product Manager",
    "job_description": "Emsi Burning Glass, the leader in labor market analytics, is seeking a product owner who is passionate about helping communities (and community-minded organizations) solve complex workforce and economic development problems through intuitive, well-designed software that delights our clients. As Jr. Product Manager, you’ll be responsible for maximizing the value of our current products to our community clients and serving as the point person for future product development. Your work will include facilitating a cross-functional team to design, develop, and implement new product initiatives; increasing the value and profitability of existing products; and keeping an accurate pulse on the client database being served by said products. This work is done under the supervision of the Director of Product.",
    "additional_job_details": [
        {
            "content": "The Successful Candidate will Thrive at: Strategic thinking – you can process a wide variety of inputs to produce a clear, prioritized plan of action that represents the needs of all our users. Using data to make decisions. Professionally communicating and articulating product value and capabilities to existing and future customers via in person, phone, and virtual meetings. Discovering a user's specific needs, jobs to be done, and use cases through an interview-style listening process. Collating and classifying quantitative and qualitative client and Emsi staff inputs and anecdotes to document insights that inform product strategy, roadmaps, and feature prioritization. Identifies, reviews, and establishes importance of trends in trouble tickets and customer contacts Helping to design and then implementing workflows and processes that surface data and insights to answer our clients’ core problems. Identifying new market opportunities. Diving into and understanding highly technical systems and processes. Collaborating with people from many different teams. Discerning the 20% of work that creates 80% of value. Rolling up their sleeves and doing what needs to be done, even if it isn’t in your comfort zone. Determining tradeoffs between features and bug fixes Gathering product analytics and baselining current performance of product. Drives team sprint productivity and continuous delivery improvement via preparing sprint inputs with detailed acceptance criteria, user stories, and user interface visualizations."
        },
        {
            "content": "Requirements: Experience and/or training in product design, UI design, software programming and testing, data integration, agile and lean processes, or data visualization Experience using product design and prototype software (e.g., Invision, Figma, Miro, Balsamiq, Adobe products ) Strong written and verbal communication skills and a professional appearance Strong task management and follow-through skills A high comfort level interpreting and working with data, data formats, and unfamiliar terminology"
        }
    ],
    "location": "Remote (Work From Home) US",
    "date_posted": 1646076395589,
    "commitment": "Full Time",
    "department": "Community Insights",
    "team": "Product",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/5731ab43-1a8e-4ea9-8ea2-a1791ba50a50"
},
{
    "job_id": "a6a99642-719d-4242-8522-bf2cd7573342",
    "job_title": "Junior Product Manager",
    "job_description": "Emsi Burning Glass, the leader in labor market analytics, is seeking a product owner who loves the idea of building products that help companies solve complex global workforce problems through intuitive, well-designed software that delights our clients. As Jr. Product Manager, you’ll be responsible for maximizing the value of our current products to our multi-national clients and serving as the point person for future product development. Your work will include facilitating a cross-functional team to design, develop, and implement new product initiatives; increasing the value and profitability of existing products; and keeping an accurate pulse on the clients being served by said products. This work is done under the supervision of the SVP of Global Product.",
    "additional_job_details": [
        {
            "content": "Primary Responsibilities: Discover a user's specific needs, jobs to be done, and use cases through an interview-style listening process Help to design and then implement workflows and processes that surface data and insights to answer our clients’ core problems. Develop the product roadmap and product requirements Collaborate with the product team to define, refine and implement product vision Interact with other PM’s, engineering teams, senior leadership, sales/customer service and marketing Create and provide product/market training materials for sales and customers Analyze data for problems and potential solutions Industry trends, customer interactions, sales performance Work with other departments to ensure product deadlines are met Drives team sprint productivity and continuous delivery improvement via preparing sprint inputs with detailed acceptance criteria, user stories, and user interface visualizations. Prepare for product launches Identify new market opportunities. Work with tools such as Figma, Jira, Miro, Asana, Salesforce"
        }
    ],
    "location": "Moscow, ID",
    "date_posted": 1650651418156,
    "commitment": "Full Time",
    "department": "Talent",
    "team": "Product",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/a6a99642-719d-4242-8522-bf2cd7573342"
},
{
    "job_id": "f75b4657-bdfb-47b9-8520-7d9bde8d93b8",
    "job_title": "Machine Learning Engineer",
    "job_description": "At Emsi Burning Glass, Machine Learning Engineers improve the efficiency of our data science capabilities by implementing tooling and pipelines that automate the training, testing, and deployment of data science models. ML Engineers work to leverage and scale the business by applying software engineering techniques and principles to data science work. Machine Learning Engineers work with the team to build end-to-end data science and machine learning systems and deploy the models to our APIs. Machine Learning Engineers collaborate with Software Engineers, Systems Engineers, and Hardware Engineering teams across the company.",
    "additional_job_details": [
        {
            "content": "Core Responsibilities: Implement, use and promote the use of experiment tracking systems to ensure that model performance is reproducible, observable, and debuggable Develop and implement scalable and efficient model training workflows on large-scale datasets to address various business problems using sophisticated statistical modeling, machine learning techniques Write and test pipeline code for developing and validating ML models, and automating tests and deployment. Develop workflows for debugging model performance Develop transient large-scale computing clusters, where appropriate, for model training using infrastructure-as-code and the cloud. Coordinate with cross-functional teams on new ideas ensuring consistency across the platform. Perform other duties as assigned. Adhere to Company’s core values."
        },
        {
            "content": "Credentials and Experience: Bachelor’s degree or above in Data Science, or a field with a strong quantitative and analytic focus (e.g. Computer Science, Engineering, Mathematics, Statistics, Operations Research or other related fields). 3 - 5 years of industry or graduate research experience solving analytical problems and building models using quantitative, statistical or machine learning approaches."
        }
    ],
    "location": "Remote (Work From Home) US",
    "date_posted": 1637604066553,
    "commitment": "Full Time",
    "department": "Corporate",
    "team": "Data and Analytics",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/f75b4657-bdfb-47b9-8520-7d9bde8d93b8"
},
{
    "job_id": "28075f3f-aa30-4b75-b48f-aad55154c071",
    "job_title": "Marketing Director",
    "job_description": "The marketing director will oversee the day-to-day operations of marketing activities for the Community Division at Emsi Burning Glass set forth by strategies collaborated on with the SVP of Business Development. The marketing director will focus on leading the Community Division marketing team through execution of the customer journey and building a steady flow of quality leads. This will include creating brand and product awareness in the economic and workforce development markets.",
    "additional_job_details": [
        {
            "content": "Responsibilites: Drive the marketing process forward by gathering insights from products and consumers, developing strategies, executing campaigns, and measuring and optimizing results. Find new ways to engage our target audience and execute campaigns that deepen users’ connection with Emsi Burning Glass. Manage and direct the day-to-day operation of the marketing unit, including management of five staff, and cross collaboration with central marketing department. Execute strategy through a marketing scrum planning/methodology Represent Emsi via webinar and in-person presentations though creation of content and some presentations; develop and manage strong internal and external relationships"
        },
        {
            "content": "Preferred Skills: Management Communication Project Management Marketing Strategy Marketing Analytics Digital Marketing Go-To-Market Strategy"
        },
        {
            "content": "Knowledge and Experience: CRM Experience [Hubspot] Lead Generation Marketing Experience with Sales Email Marketing"
        }
    ],
    "location": "Remote (Work From Home) US",
    "date_posted": 1646775267274,
    "commitment": "Full Time",
    "department": "Community Insights",
    "team": "Marketing",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/28075f3f-aa30-4b75-b48f-aad55154c071"
},
{
    "job_id": "595c9063-5719-436f-8f58-a1ac6df9b3b9",
    "job_title": "Press Secretary",
    "job_description": "HAVE A NOSE FOR NEWS? IF YOU ANSWERED YES..... you've found the Press Secretary role that you've been looking for! A FEW THINGS WE'RE LOOKING FOR IN THE RIGHT CANDIDATE: You'll have a sense for what makes good news and an understanding of what reporters need. You'll be a quick thinker and capable of quick rapid-responses. You'll able to think through longer-term strategies for growing earned media. And ..You'll be comfortable with data and able to explain complicated topics clearly and simply. We're rapidly growing and fiercely dedicated to serving our clients while having fun and celebrating our successes!!",
    "additional_job_details": [
        {
            "content": "Some of the Things You'll be Doing: Interact daily with the local and national press. Answer all press inquiries. Identify, maintain, and grow the company’s relationship with relevant members of the press, influencers, cable and broadcast news producers, and others as needed. Oversee drafting and distribution of company press releases and other press and media related communications. Serve as an intermediary between company staff of labor market experts and media organizations, arranging interviews and supporting interviewees. Develop and oversee implementation of strategies to grow the company footprint among relevant press channels. Develop and maintain the company’s press lists. Develop and maintain the company’s cable and broadcast news show producers list. Develop and maintain the company’s insiders/influencers list. Conduct regular, consistent outreach to media using the company’s Hubspot news email and Cision press database. Build and expand media outreach in the UK and European Union. Manage communications campaigns for various events. Supervise press communications team of interns. Oversee the management and maintenance of the Emsi Burning Glass Speakers Bureau. Monitor the national news landscape daily for any relevant news stories or stories that mention Emsi Burning Glass or closely related issues to the company’s line of work. Oversee daily production and distribution of an internal news briefing for the entire company, highlighting relevant news stories and “Emsi Burning Glass in the news.” Other duties as assigned."
        },
        {
            "content": "What You'll Need: Capacity and desire to partner with customers, operate as a team, sustain our company and work with gratitude. Strong verbal and written communication skills. Strong interpersonal and customer service skills. Solid organizational skills and attention to detail. Strong time management skills with a proven ability to meet deadlines. Strong analytical and problem-solving skills. Ability to function well in a high-paced and at times stressful environment. Proficient with Google Workspace or related software. Education and Experience: A Bachelor’s degree and three years experience in a related field. Experience as a supervisor overseeing personnel. OR Any combination of educational and experience that would provide the applicant with the desired skill, knowledge, and ability required to perform the job."
        },
        {
            "content": "Here are Just Some of the Perks our Team Members Enjoy: We will consider remote options. You'll be a valued member of a supportive and talented team. Career Development Opportunities Competitive pay and great benefits that include: Health Insurance Dental and Vision Plans 401k with match Generous PTO Life Insurance Options"
        }
    ],
    "location": "Remote (Work From Home) US",
    "date_posted": 1650043961039,
    "commitment": "Full Time",
    "department": "Corporate",
    "team": "Public Relations",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/595c9063-5719-436f-8f58-a1ac6df9b3b9"
},
{
    "job_id": "c0fd5d59-1578-4952-a98e-002742db9db5",
    "job_title": "Product Specialist",
    "job_description": "Product Specialists play a pivotal role in assisting our educational partners in demonstrating the career outcomes of their programs and helping guide students to the right programs and careers. In this role you’ll be providing technical expertise and support to customer needs, internal processes, and product teams. In carrying out the objective of this position, a successful candidate will be committed to our values by working with gratitude within our team to serve our clients and sustain our company. This is a full-time, entry-level position reporting to the Product Manager of Career Coach.",
    "additional_job_details": [
        {
            "content": "Core Responsibilities: Manage new client implementations for all software applications Act as a knowledgeable resource on products Build and maintain Career Coach and Widget Builder Sites Create reports and resources for all software applications Gather usage data and generate custom reports using Excel"
        },
        {
            "content": "Knowledge, Skills, and Abilities: Strong oral and written communication skills Prioritization Excellent time management Strong organizational skills"
        },
        {
            "content": "Traits: Detail, customer, and team-oriented Self-starter Technical aptitude"
        },
        {
            "content": "Credentials and Experience: Advanced experience with Excel (advanced functions, graphing, pivot tables, Vlookup formulas) Experience working in an office setting is preferred but not required"
        },
        {
            "content": "Physical Requirements/ Work Environment: Those necessary for general office work Remote or office environment for the majority of the time"
        }
    ],
    "location": "Remote Available",
    "date_posted": 1651254721096,
    "commitment": "Full Time",
    "department": "Education",
    "team": "Product",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/c0fd5d59-1578-4952-a98e-002742db9db5"
},
{
    "job_id": "7fb034cf-bbfc-437c-8279-3a336a77fafc",
    "job_title": "Research Analyst",
    "job_description": "The Research Analyst at Emsi Burning Glass works with the Applied Research team to produce innovative research, consulting reports, datasets, data models, and visualizations that answer our clients’ most pressing problems about the future of work. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing to market actionable insights.",
    "additional_job_details": [
        {
            "content": "Core Responsibilities: Support client projects by performing quantitative analysis using EMSI Burning Glass’s world-class workforce data and other data sources to research, model, and recommend workforce solutions for global employers. Develop knowledge of issues related to human resources, workforce analytics and planning, and/or the impact of emerging technologies on the future of work. Generate custom datasets, reports, and visualizations that solve clients’ most pressing workforce challenges. Communicate key insights and recommendations to clients and consult clients on how to use data to make data-driven decisions. Develop innovative analytical models and document the methodology and findings in a manner accessible to a variety of audiences. Contribute to positive team culture by participating in team-building activities and being a supportive and empathetic colleague."
        },
        {
            "content": "Knowledge, Skills, Abilities: Strong written and verbal communication skills. Strong analytical skills. Strong quality assurance skills with attention to detail in both quantitative analyses and technical writing. Proficiency with SQL, Python, or related analytical tools and programming languages. Proficiency with Microsoft Office Suite and Google Suite with advanced skills in Excel and PowerPoint. Ability to work effectively both independently and in a team environment. Creative problem-solving skills and the ability to look at the numbers, trends, and data to derive conclusions based on findings. Ability to compose written analyses that explain complex economic or analytical concepts in simple terms."
        },
        {
            "content": "Credentials and Experience: Bachelor’s degree or above in a field with a strong quantitative and analytic focus, or at least 3-years of experience in performing statistical or economic analysis. Experience making and communicating data-driven decisions, preferably in a role related to consulting, human resources, workforce planning, economic analysis, or a similar environment."
        }
    ],
    "location": "Boston, Massachusetts",
    "date_posted": 1630016219922,
    "commitment": "Full Time",
    "department": "Talent",
    "team": "Professional Services",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/7fb034cf-bbfc-437c-8279-3a336a77fafc"
},
{
    "job_id": "3737fac0-90e8-4756-96ba-67893d393b57",
    "job_title": "Research Analyst Intern",
    "job_description": "The Research Analyst Intern at Emsi Burning Glass works with the Applied Research team to produce innovative research, consulting reports, datasets, data models, and visualizations that answer our clients’ most pressing problems about the future of work. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing to market actionable insights.",
    "additional_job_details": [
        {
            "content": "Job Duties and Responsibilities: Support client projects by performing quantitative analysis using EMSI Burning Glass’s world-class workforce data and other data sources to research, model, and recommend workforce solutions for global employers. Generate custom datasets, reports, and visualizations that solve clients’ most pressing workforce challenges. Communicate key insights and recommendations to clients and consult clients on how to use data to make data-driven decisions. Develop innovative analytical models and document the methodology and findings in a manner accessible to a variety of audiences. Contribute to positive team culture by participating in team-building activities and being a supportive and empathetic colleague."
        },
        {
            "content": "Essential Functions, Knowledge, Skills and Abilities: Enrolled in or a recent graduate of a Bachelor’s or Master’s degree program in economics, public administration, business, data science, community planning, public policy, or related field Strong analytical and technical skills and demonstrated ability to apply economic theory or statistical techniques Ability to write about and explain complex concepts in simple, concrete terms Ability to meet milestones while juggling multiple responsibilities Ability to work independently, while learning from members of the team Keen business development sense and strong client relationship skills Strong proficiency with MS office (particularly Excel, Word, and PowerPoint) and SQL, Python, or related applications is required. Experience with Tableau is ideal."
        }
    ],
    "location": "Boston, Massachusetts",
    "date_posted": 1639417025102,
    "commitment": "Internship",
    "department": "Talent",
    "team": "Professional Services",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/3737fac0-90e8-4756-96ba-67893d393b57"
},
{
    "job_id": "58606b13-40fa-4dbe-942a-94c0bf722cf1",
    "job_title": "Senior Consultant",
    "job_description": "The Senior Consultant at Emsi Burning Glass works with the Applied Research team to produce innovative research, consulting reports, datasets, data models, and visualizations that answer our clients’ most pressing problems about the future of work. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing to market actionable insights. In carrying out the objectives of this position, a successful candidate will be committed to a service-first mindset and strive to empower our clients, our employees, and our communities.",
    "additional_job_details": [
        {
            "content": "Core Responsibilities: Support client projects by performing quantitative analysis using EMSI Burning Glass’s world-class workforce data and other data sources to research, model, and recommend workforce solutions for enterprise-scale clients. Develop project plans and oversee the execution and successful completion of custom consulting and research deliverables. Develop subject matter expertise on issues related to human resources, workforce analytics and planning, and/or the impact of emerging technologies on the future of work. Generate custom datasets, reports, dashboards, and visualizations that solve clients’ most pressing workforce challenges. Communicate key insights and recommendations to clients, support and nurture client relationships, and consult clients on how to use data to make data-driven decisions. Develop innovative analytical models and document the methodology and findings in a manner accessible to a variety of audiences. Contribute to positive team culture by participating in team-building activities and being a supportive and empathetic colleague."
        },
        {
            "content": "Knowledge, Skills, Abilities: Strong written and verbal communication skills. Strong analytical skills. Strong quality assurance skills with attention to detail in both quantitative analyses and technical writing. Proficiency with SQL, Python, or related analytical tools and programming languages. Proficiency with Microsoft Office Suite and Google Suite with advanced skills in Excel and PowerPoint. Experience with Tableau or similar BI tools is a plus. Knowledge of human resources, people analytics, HRIS software (such as Workday or SuccessFactors), or related fields is a plus. Prior project management experience is strongly preferred. Keen business development sense and strong client relationship skills. Ability to work effectively both independently and in a team environment. Creative problem-solving skills and the ability to look at the numbers, trends, and data to derive conclusions based on findings. Ability to compose written analyses that explain complex economic or analytical concepts in simple terms."
        },
        {
            "content": "Credentials and Experience: Bachelor’s degree or above in a field with a strong quantitative and analytic focus, or at least 3-years of experience in performing statistical or economic analysis. Experience making and communicating data-driven decisions, preferably in a role related to consulting, human resources, workforce planning, economic analysis, or a similar environment."
        }
    ],
    "location": "Boston, Massachusetts",
    "date_posted": 1630351608795,
    "commitment": "Full Time",
    "department": "Talent",
    "team": "Professional Services",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/58606b13-40fa-4dbe-942a-94c0bf722cf1"
},
{
    "job_id": "6c85559c-8037-43ab-9694-069d995393f1",
    "job_title": "Senior Data Scientist",
    "job_description": "The Senior Data Scientist at Emsi Burning Glass works with the Product and Data teams to produce innovative models, datasets, and visualizations that address our clients’ most pressing problems about the future of work. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing actionable insights to our product suite.",
    "additional_job_details": [
        {
            "content": "Core Responsibilities: Build pragmatic, scalable, and statistically rigorous solutions to large-scale labor market data problems by leveraging or developing state-of-the-art statistical and machine learning methodologies on top of Emsi BG’s data infrastructure. Work with and manage very large (and messy) data sets; build ML pipelines that scale to work with this data effectively. Experience working with and designing continuous machine learning pipelines is required. Support product development by performing quantitative analysis using Emsi Burning Glass’s world-class demand and supply data, as well as other data sources to investigate, manipulate, and model solutions for products. Manage large and/or complex projects to completion. Make business/technology trade-offs when appropriate. Work cross-functionally to define problem statements, collect data, build analytical models and make recommendations. Champion the incorporation of new tools/methods/techniques. Possess a strong ability to connect data science results and methods with use cases and communicate key insights and recommendations to internal and external stakeholders across the organization. Develop innovative analytical models and document the methodology and findings in a manner accessible to a variety of audiences. Research and drive new product capabilities searching for innovative ideas and product enhancements using data. Contribute to positive team culture by participating in team-building activities and being a supportive and empathetic colleague. Actively mentor and support junior colleagues."
        },
        {
            "content": "Knowledge, Skills, Abilities: Proficiency with SQL, Python, and related analytical tools and programming languages. Experience with Machine Learning, Statistics, or other data analysis tools and techniques. Strong written and verbal communication skills. Strong analytical skills. Strong quality assurance skills with attention to detail in both quantitative analyses and technical writing/documentation. Proficiency with Microsoft Office Suite and Google Suite with advanced skills in Excel and PowerPoint. Experience with Tableau or similar BI tools is a plus. Ability to work effectively both independently and in a team environment. Creative problem-solving skills and the ability to look at the numbers, trends, and data to derive conclusions based on findings."
        },
        {
            "content": "Credentials and Experience: Bachelor’s degree or above in Data Science, or a field with a strong quantitative and analytic focus (e.g. Computer Science, Engineering, Mathematics, Statistics, Operations Research or other related fields). 3 - 5 years of industry or graduate research experience solving analytical problems and building models using quantitative, statistical or machine learning approaches."
        }
    ],
    "location": "Remote (Work From Home) US",
    "date_posted": 1633379560456,
    "commitment": "Full Time",
    "department": "Corporate",
    "team": "Data and Analytics",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/6c85559c-8037-43ab-9694-069d995393f1"
},
{
    "job_id": "31b879cc-d97b-4407-b745-b25278490684",
    "job_title": "Senior Full Stack Web Developer",
    "job_description": "Position Overview Emsi Burning Glass is a trusted advisor on labor market information for customers across a wide array of markets. We build SaaS products that combine many different kinds of workforce data to accurately inform our clients’ decisions about college course offerings, hiring, economic development, and much more. We need a senior full stack web developer who’s passionate about building quality software with great engineers while working closely with product teams. In this role, you would be leading a small team building new, dynamic, data-heavy web applications that solve real problems for our customers. As a senior software engineer at EmsiBG, you have a position of technical leadership in a cross-functional team. You’d be expected to perform the same kind of sprint work as the other members of the team – writing, reviewing, and testing code – but at an exemplary level. You would take a leading role in feasibility and scoping discussions with our product teams, and your deep knowledge of industry trends would give you insight into how best to solve the problems they present. If you’re interested in joining a culture of grateful excellence, if you want to mentor junior engineers while growing your own engineering skill, we’d love to meet you.",
    "additional_job_details": [
        {
            "content": "People who succeed in this position are: Team oriented and ready to work closely with other developers Comfortable with working in rapid development cycles, including prototyping Skilled communicators and obsessive documentors Ready to lead by example Grateful"
        },
        {
            "content": "Requirements: 3 or more years of experience in building production applications with ES6 and React.js (Angular, Svelte, Vue also considered) 3 or more years of experience with server-side languages like Node, Python, and PHP. 3 or more years of experience with production environments in AWS (Google Cloud, Azure also considered) and extensive experience with container orchestration and tools like Docker, Kubernetes, and Terraform. Experience with structured databases (e.g. MySQL, PostgreSQL)."
        },
        {
            "content": "Great candidates also have: Designed and implemented production codebases from scratch. Experience collaborating with designers and product owners extensively, and understand the trade-offs required to remain a profitable business."
        }
    ],
    "location": "Remote (Work From Home) US",
    "date_posted": 1649372315788,
    "commitment": "Full Time",
    "department": "Corporate",
    "team": "Engineering",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/31b879cc-d97b-4407-b745-b25278490684"
},
{
    "job_id": "4db56402-4130-4f30-b423-26ffb693471c",
    "job_title": "Social Media Manager",
    "job_description": "Emsi Burning Glass is searching for a talented marketing professional to join our team as a Social Media Manager. This position oversees the daily management of, and strategic plan development and implementation for, Emsi Burning Glass social media accounts (Linkedin, Twitter. Facebook, Instagram, and Youtube). The strategy will focus on driving results in all areas of the customer journey, creating awareness, generating engagement, and continuously promoting our content to key market segments.",
    "additional_job_details": [
        {
            "content": "The primary job duties of this include: Supporting the company brand among existing and potential clients and other stakeholders. Driving a larger number of potential clients and potential employees to the Emsi Burning Glass website. Amplifying the Emsi Burning Glass voice in the corporate, higher-ed, and government online echo chambers. Own the global posting strategy, in collaboration with the corporate communications team, across all networks that build our reputation and drive engagement. Research, develop and implement unique strategies across platforms, rooted in analytics. Consistently develop and execute quantifiable testing strategies and report back the results to the greater marketing team. Collaborate with various stakeholders on content priorities and coordination. Collaborate with the Art Director, business unit writers on content to share. Partner with the digital marketing team to uphold best practices for paid social campaign execution."
        },
        {
            "content": "Experience and Skills: 2+ years of hands-on experience executing social media strategies. Demonstrated success improving social programs across KPIs like engagement, conversions, and pipeline generation. Understanding of organic social, paid social and digital marketing best practices and latest tools and trends. Strong project management skills and relationship-building skills across various teams. Data-driven and very comfortable with handling and analyzing data, and building reports to track performance metrics. Comfortable presenting ideas and reports to stakeholder groups and leadership. Experience with copywriting. Degree in marketing, communications, or related fields preferred ."
        }
    ],
    "location": "Moscow, ID",
    "date_posted": 1636569152420,
    "commitment": "Full Time",
    "department": "Corporate",
    "team": "Public Relations",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/4db56402-4130-4f30-b423-26ffb693471c"
},
{
    "job_id": "e9fa0594-6ac2-45d1-b318-dac2cd5bfd0a",
    "job_title": "Software Engineer",
    "job_description": "Emsi Burning Glass is looking for a skilled software engineer to work on the Classifiers & Extractors team. This team builds and maintains high-performance text extraction and classification libraries used to analyze job postings, resumes, and similar documents. In addition to the machine learning solutions, this team also produces the internal tooling and data pipelines to support teams of taxonomists and curators working to continuously improve Emsi’s classifications and libraries. The ideal candidate has significant experience working in high-performance systems languages, a working knowledge of linear algebra, and at least basic familiarity with machine learning techniques.",
    "additional_job_details": [
        {
            "content": "Daily Responsibilities: : Develop and maintain extractors, classifiers, and the data pipelines to support them. Research the most effective solutions to text extraction and classification problems. Optimize solutions for maximal document per second per core throughput. Work with Emsi’s taxonomists and data curators to build the internal tooling and data pipelines necessary to continuously improve our libraries."
        },
        {
            "content": "Key Skills: Systems programming on Linux, including working knowledge of virtual memory, optimizing for cacheline performance, and using the perf toolkit. Proficient in the D programming language or similar (C, C++). At least basic knowledge of machine learning techniques. Working knowledge of linear algebra, experience with Intel MKL or similar desirable. Good knowledge of algorithms and data structures. Fluent English, written and spoken. Git version control. Debugging with GDB. AWS S3, EC2, Athena."
        }
    ],
    "location": "Moscow, ID",
    "date_posted": 1641841646174,
    "commitment": "Full Time",
    "department": "Corporate",
    "team": "Data and Analytics",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/e9fa0594-6ac2-45d1-b318-dac2cd5bfd0a"
},
{
    "job_id": "aa8b51fa-04cf-4bd4-9318-2940748da212",
    "job_title": "Software Engineering API Intern",
    "job_description": "Only local (Moscow, ID/Pullman, WA region) candidates will be considered at this time. Emsi Burning Glass is a trusted advisor on labor market information for customers across a wide array of markets. Much of our data is available via APIs which power our software applications, and more recently are available to external customers. You can view our current API offering here: https://www.economicmodeling.com/apis/. If you are interested in joining a team focused on building out APIs and related infrastructure, we’d love to hear from you. In this role you would be responsible both for expanding our microservice architecture to include new APIs and maintaining our existing fleet.",
    "additional_job_details": [
        {
            "content": "People who succeed in this position are: Team oriented and ready to work closely with other developers Determined to produce clean, well-tested code Comfortable working in rapid development cycles Skilled communicators Enthusiastic about learning and pushing the envelope Emsi APIs Get direct access to the robust data sets powering our software solutions and harness Emsi data to create custom data displays for your organization."
        }
    ],
    "location": "Moscow, ID",
    "date_posted": 1650941553722,
    "commitment": "Internship",
    "department": "Corporate",
    "team": "Engineering",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/aa8b51fa-04cf-4bd4-9318-2940748da212"
},
{
    "job_id": "1454d90e-65d4-4a78-b6e2-8ced1c6a01a8",
    "job_title": "Software Product Manager",
    "job_description": "Emsi Burning Glass is a trusted advisor on labor market information for customers across a wide array of markets. Our Analyst SaaS product combines many different kinds of workforce data to accurately inform our clients’ decisions about college course offerings, hiring, site selection, economic development, and much more. As we look to make better and better use of our industry-leading data, we need a product manager to help manage the Analyst software platform. With tremendous runway in multiple markets, we are looking for a thoughtful, data-driven, customer-focused product manager to manage and sequence projects on the Analyst platform. This senior product role will also be responsible for identifying and pursuing new platform capabilities and efficiencies, as well as assessing platform usage through analytics software. If you’re ready to join a high-functioning team of product managers working closely with talented engineers, designers, and data experts, we’d love to hear from you.",
    "additional_job_details": [
        {
            "content": "Job Responsibilities: Grow platform utilization. Using an experimental and user metrics driven approach, drive new value and new capabilities on the platform. Expand usage of the existing capabilities across products, and identify and eliminate waste. Be the single point of contact for the Analyst platform. Coordinate updates and documentation with teams in legal, marketing, sales, etc.. For example, updating in-tool privacy policies, updating in-tool integrations, and vendor questionnaires. Own platform statistics and usage data. Address one-off data pull requests while managing and implementing systems for collecting needed usage data. Coordinate projects that involve multiple internal teams. Drive integrated product initiatives like data updates and API changes. Own platform backlogs. Communicate with product owners to optimize work sequencing, identify engineering capacity, and clarify requirements."
        },
        {
            "content": "Proficiencies: Strong written and verbal communication skills Strong organizational skills Ability to clearly articulate technical concepts Independent data gathering skills Basic data analysis skills UX/UI generalist"
        }
    ],
    "location": "Moscow, ID",
    "date_posted": 1635808313283,
    "commitment": "Full Time",
    "department": "Corporate",
    "team": "Product",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/1454d90e-65d4-4a78-b6e2-8ced1c6a01a8"
},
{
    "job_id": "f2ec98d7-7508-41f2-ad8a-d249b7e1d44a",
    "job_title": "Sr. Product Designer",
    "job_description": "The Education Product & Design Team at Emsi Burning Glass is laser-focused on helping institutions provide students with the educational opportunities they need to thrive in a competitive labor market. Our current products turn labor market data into insights that drive new academic program development, help institutions attract, retain and support students, and track post-graduate outcomes. Our new products will continue to drive impact in higher education, for students, and in the labor market at large. We’re on the hunt for a talented designer to join our team. As a designer at Emsi Burning Glass, you will design and deliver elegant product experiences as part of a cross-functional team. You will continuously build on your understanding of the challenges present in higher education and the uses of labor market data in that context. You'll talk to our customers to empathize with their needs. You’ll partner with product managers and engineers to design solutions that serve customer and learner needs and deliver value for the company.",
    "additional_job_details": [
        {
            "content": "Why You Will Love This Role!: You’ll help shape the future of higher education -- the product interactions you co-create will impact the educational opportunities and workplace readiness of learners all over the globe. You’ll play a key role in evolving our design culture helping to define and drive new design processes. You’ll join a collaborative, supportive team that insists on having fun at work. You'll have the flexibility to work from your home office"
        },
        {
            "content": "Why We'll Love You!: With 5+ years of experience in software product design, you have a portfolio that demonstrates your experience creating sketches, wireframes, userflows, and high-fidelity prototypes that define mobile and desktop interfaces for data-rich products. You’re proficient with Figma, Sketch, Invision or similar design and prototyping tools. You bring a broad toolkit for product design (e.g. design thinking, lean UX, design sprints) and you keep up to date with best practices in usability, accessibility, and visual design. You’re an excellent communicator with a proven ability to build cross-functional relationships and influence. You clearly communicate design decisions and synthesize and iterate based on feedback. You’re comfortable balancing multiple workstreams and building process where it’s needed. Your ability to see the bigger picture helps you prioritize and work efficiently. Your attention to detail means you deliver elegant, consistent designs. If you don't think you meet all of the job criteria and are still interested in the job, please apply! We know that a diverse workforce enriches us with the talent, perspective, and inspiration we need to achieve our mission. Nobody checks every box, and we're looking for someone excited to join our team."
        },
        {
            "content": "Sound Like You? Great! We're Looking Forward to Meeting You!: Hurry up and submit your resume and include a link to your portfolio!"
        }
    ],
    "location": "Remote (Work From Home) US",
    "date_posted": 1646257671667,
    "commitment": "Full Time",
    "department": "Education",
    "team": "Product",
    "job_posting_url": "https://jobs.lever.co/economicmodeling/f2ec98d7-7508-41f2-ad8a-d249b7e1d44a"
}
]